# DocumentDifference Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentDifference Methods
DocumentDifference Class See Also
---
The DocumentDifference type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCreatedElementIds | Created element id collection. |
| GetDeletedElementIds | Deleted element id collection. For non-worksharing models, this will always be an empty collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetModifiedElementIds | Modified element id collection. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace